app/controllers/wishes_controller.rb

  def index
    @wishes = Wish.valid_wish.all
---
SELECT "wishes".* FROM "wishes" WHERE (valid_until >= '2013-09-19' and saved = 't')